import { useParams } from 'react-router-dom';

import Comment from '@c/comment';

import './index.scss';

function Post(): JSX.Element {
  const { id = '' } = useParams();

  return (
    <div>
      <div className='post article-card is-centered is-rounded nes-container with-title font-bold'>
        <p className='title article-title'>Javascript高级程序设计</p>
        <p>
          昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风
        </p>
        <p>昨夜星辰昨夜风昨夜星辰昨夜风昨夜星辰昨夜风</p>
        <p className='absolute px-2 bg-white right-4 -bottom-4'>7 个月前</p>
      </div>
      <Comment id={id} />
    </div>
  );
}

export default Post;
